# Интерфейс (англ. interface) — основной шаблон проектирования, являющийся
# общим методом для структурирования компьютерных программ для того, чтобы их
# было проще понять. В общем, интерфейс — это класс, который обеспечивает
# программисту простой или более программно-специфический способ доступа к
# другим классам.
#
# Интерфейс может содержать набор объектов и обеспечивать простую,
# высокоуровневую функциональность для программиста (например, Шаблон Фасад);
# он может обеспечивать более чистый или более специфический способ
# использования сложных классов («класс-обёртка»); он может использоваться
# в качестве «клея» между двумя различными API (Шаблон Адаптер); и для многих
# других целей.
#
# Другими типами интерфейсных шаблонов являются: Шаблон делегирования,
# Шаблон компоновщик, и Шаблон мост.
